# Numpy와 pandas
- pandas 는 numpy 기반 1차원 배열 데이터를 기반으로 header(column name) 준 데이터를 처리하는 데 특화됨


# 데이터 불러오기 및 저장
- 데이터베이스, 스프레드시트, csv, json 등등
# 데이터프레임
- 데이터프레임 이해
- 데이터 분석

In [8]:
import numpy as np
import pandas as pd

item_no = np.random.randint(0, 10, size=5)
item_name = np.array(['dress','shirt', 'shorts', 'pants', 'hat'])
item_values = np.random.rand(5) * 1000

print(f'{item_no = }')
print(f'{item_name = }')

df = pd.DataFrame({'item_no':item_no, 'item_name': item_name, 'value':item_values})
print(df)
print(type(df))
print(df['item_no'])
print(type(df['item_no']))

item_no = array([2, 0, 0, 2, 5])
item_name = array(['dress', 'shirt', 'shorts', 'pants', 'hat'], dtype='<U6')
   item_no item_name       value
0        2     dress  698.254322
1        0     shirt  487.194745
2        0    shorts  142.457106
3        2     pants  463.018380
4        5       hat  171.568338
<class 'pandas.core.frame.DataFrame'>
0    2
1    0
2    0
3    2
4    5
Name: item_no, dtype: int32
<class 'pandas.core.series.Series'>

In [14]:
df.dtypes

df.loc[2, 'item_name'] = 0
print(df)
print(df.dtypes)

   item_no item_name       value
0        2     dress  698.254322
1        0     shirt  487.194745
2        0         0  142.457106
3        2     pants  463.018380
4        5       hat  171.568338
item_no        int32
item_name     object
value        float64
dtype: object

In [21]:
data = {
    'category':['A','B','A','B'],
    'Name': ['John', 'Anna', 'Perter', 'Linda'],
    'Age':[28,34,45,32],
    'Income': [50000, 6000, 8000, 7500]
}

df = pd.DataFrame(data)
df

  category    Name  Age  Income
0        A    John   28   50000
1        B    Anna   34    6000
2        A  Perter   45    8000
3        B   Linda   32    7500

In [30]:
# groupby

df_grouped = df.drop('Name', axis=1).groupby('category').median()
df_grouped

           Age   Income
category
A         36.5  29000.0
B         33.0   6750.0

In [35]:
df_pivot = pd.pivot_table(data=df, index='category', 
        values=['Age','Income'], aggfunc=['sum','max'])
df_pivot

         sum        max
         Age Income Age Income
category
A         73  58000  45  50000
B         66  13500  34   7500

In [40]:
print(df)
df['Name'] = df['Name'].apply(lambda x: x+'_10')
df

  category    Name  Age  Income
0        A    John   28   50000
1        B    Anna   34    6000
2        A  Perter   45    8000
3        B   Linda   32    7500

  category       Name  Age  Income
0        A    John_10   28   50000
1        B    Anna_10   34    6000
2        A  Perter_10   45    8000
3        B   Linda_10   32    7500